app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "contact", "address", "nid", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @patient = Patient.new(patient_params)
    @patient.user_id = current_user.id

    if @patient.save

SELECT "patients".* FROM "patients" WHERE "patients"."nid" = ? LIMIT ?  [["nid", "121112"], ["LIMIT", 1]]
SELECT 1 AS one FROM "patients" WHERE "patients"."nid" = ? LIMIT ?  [["nid", "121112"], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."nid" = ?  [["nid", "121112"]]
---
  def search
    if Patient.exists?(nid: params[:nid])
        @patient = Patient.find_by(nid: params[:nid])
        @records = Record.all.where(nid: params[:nid])