app/controllers/records_controller.rb

SELECT "record_blocks".* FROM "record_blocks" ORDER BY "record_blocks"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "record_blocks" ("hashh", "previous_hash", "created_at", "updated_at", "record") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["hashh", "367917636"], ["previous_hash", "-369286724"], ["created_at", "2024-03-02 19:27:05.925338"], ["updated_at", "2024-03-02 19:27:05.925338"], ["record", "#<Record:0x000001eb7bd04798>"]]
INSERT INTO "records" ("disease", "medicine", "patient_id", "user_id", "created_at", "updated_at", "nid") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @record = Record.new(record_params)
    @record.user_id = current_user.id
    @patient = Patient.find_by(params[:nid])
    @record.patient_id = @patient.id


    if RecordBlock.last
      @block = Block.next(RecordBlock.last, record_params.to_s, RecordBlock.last.hashh)

      @newblock = RecordBlock.new(
          previous_hash: @block.previous_hash,
          record: @block.data,
          hashh: @block.hash
      )

      if @record.save && @newblock.save

INSERT INTO "records" ("disease", "medicine", "patient_id", "user_id", "created_at", "updated_at", "nid") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["disease", "Gastric"], ["medicine", "Losectil"], ["patient_id", 1], ["user_id", 33], ["created_at", "2024-03-02 19:06:11.535276"], ["updated_at", "2024-03-02 19:06:11.535276"], ["nid", "121112"]]
---
      )


      if @record.save && @newblock.save