app/controllers/signup_controller.rb

    def create
      user = User.new(user_params)

      if user.save
---
INSERT INTO "users" ("email", "password_digest", "license", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "aakashaayat@gmail.com"], ["password_digest", "[FILTERED]"], ["license", "1A2B3C"], ["created_at", "2024-01-07 06:35:07.361722"], ["updated_at", "2024-01-07 06:35:07.361722"]]