app/controllers/signin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."license" = ? LIMIT ?  [["license", "1A2B3C"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(license: params[:license])